Alex2269/stm32_tft/stm32-nucleo/stm32f446re_nucleo_tft_touch/LCD_Touch/display/registers.h
// Register names from Peter Barrett's Microtouch code
#define ILI932X_START_OSC			0x00
#define ILI932X_DRIV_OUT_CTRL		0x01
#define ILI932X_DRIV_WAV_CTRL		0x02
#define ILI932X_ENTRY_MOD			0x03
#define ILI932X_RESIZE_CTRL			0x04
#define ILI932X_DISP_CTRL1			0x07
#define ILI932X_DISP_CTRL2			0x08
#define ILI932X_DISP_CTRL3			0x09
#define ILI932X_DISP_CTRL4			0x0A
#define ILI932X_RGB_DISP_IF_CTRL1	0x0C
#define ILI932X_FRM_MARKER_POS		0x0D
#define ILI932X_RGB_DISP_IF_CTRL2	0x0F
#define ILI932X_POW_CTRL1			0x10
#define ILI932X_POW_CTRL2			0x11
#define ILI932X_POW_CTRL3			0x12
#define ILI932X_POW_CTRL4			0x13
#define ILI932X_GRAM_HOR_AD			0x20
#define ILI932X_GRAM_VER_AD			0x21
#define ILI932X_GRAM_WR				0x22
#define ILI932X_POW_CTRL7			0x29
#define ILI932X_FRM_RATE_COL_CTRL	0x2B
#define ILI932X_GAMMA_CTRL1			0x30
#define ILI932X_GAMMA_CTRL2			0x31
#define ILI932X_GAMMA_CTRL3			0x32
#define ILI932X_GAMMA_CTRL4			0x35
#define ILI932X_GAMMA_CTRL5			0x36
#define ILI932X_GAMMA_CTRL6			0x37
#define ILI932X_GAMMA_CTRL7			0x38
#define ILI932X_GAMMA_CTRL8			0x39
#define ILI932X_GAMMA_CTRL9			0x3C
#define ILI932X_GAMMA_CTRL10		0x3D
#define ILI932X_HOR_START_AD		0x50
#define ILI932X_HOR_END_AD			0x51
#define ILI932X_VER_START_AD		0x52
#define ILI932X_VER_END_AD			0x53
#define ILI932X_GATE_SCAN_CTRL1		0x60
#define ILI932X_GATE_SCAN_CTRL2		0x61
#define ILI932X_GATE_SCAN_CTRL3		0x6A
#define ILI932X_PART_IMG1_DISP_POS	0x80
#define ILI932X_PART_IMG1_START_AD	0x81
#define ILI932X_PART_IMG1_END_AD	0x82
#define ILI932X_PART_IMG2_DISP_POS	0x83
#define ILI932X_PART_IMG2_START_AD	0x84
#define ILI932X_PART_IMG2_END_AD	0x85
#define ILI932X_PANEL_IF_CTRL1		0x90
#define ILI932X_PANEL_IF_CTRL2		0x92
#define ILI932X_PANEL_IF_CTRL3		0x93
#define ILI932X_PANEL_IF_CTRL4		0x95
#define ILI932X_PANEL_IF_CTRL5		0x97
#define ILI932X_PANEL_IF_CTRL6		0x98

#define HX8347G_COLADDRSTART_HI		0x02
#define HX8347G_COLADDRSTART_LO		0x03
#define HX8347G_COLADDREND_HI		0x04
#define HX8347G_COLADDREND_LO		0x05
#define HX8347G_ROWADDRSTART_HI		0x06
#define HX8347G_ROWADDRSTART_LO		0x07
#define HX8347G_ROWADDREND_HI		0x08
#define HX8347G_ROWADDREND_LO		0x09
#define HX8347G_MEMACCESS			0x16
#define HX8347G_SRAM_WR				0x22

#define ILI9341_SOFTRESET			0x01
#define ILI9341_SLEEPIN				0x10
#define ILI9341_SLEEPOUT			0x11
#define ILI9341_NORMALDISP			0x13
#define ILI9341_INVERTOFF			0x20
#define ILI9341_INVERTON			0x21
#define ILI9341_GAMMASET			0x26
#define ILI9341_DISPLAYOFF			0x28
#define ILI9341_DISPLAYON			0x29
#define ILI9341_COLADDRSET			0x2A
#define ILI9341_PAGEADDRSET			0x2B
#define ILI9341_MEMORYWRITE			0x2C
#define ILI9341_MEMORYREAD			0x2E
#define ILI9341_MEMCONTROL			0x36
#define ILI9341_MADCTL				0x36
#define ILI9341_PIXELFORMAT			0x3A
#define ILI9341_FRAMECONTROL		0xB1
#define ILI9341_DISPLAYFUNC			0xB6
#define ILI9341_ENTRYMODE			0xB7
#define ILI9341_POWERCONTROL1		0xC0
#define ILI9341_POWERCONTROL2		0xC1
#define ILI9341_VCOMCONTROL1		0xC5
#define ILI9341_VCOMCONTROL2		0xC7
#define ILI9341_POWERCONTROLA		0xCB
#define ILI9341_POWERCONTROLB		0xCF
#define ILI9341_POSITIVEGAMMACORR	0xE0
#define ILI9341_NEGATIVEGAMMACORR	0xE1
#define ILI9341_DRIVERTIMINGCTLA	0xE8
#define ILI9341_DRIVERTIMINGCTLB	0xEA
#define ILI9341_POWERONSEQCONTROL	0xED
#define ILI9341_ENABLE3G			0xF2
#define ILI9341_PUMPRATIOCONTROL	0xF7

#define ILI9341_MADCTL_MY			0x80
#define ILI9341_MADCTL_MX			0x40
#define ILI9341_MADCTL_MV			0x20
#define ILI9341_MADCTL_ML			0x10
#define ILI9341_MADCTL_RGB			0x00
#define ILI9341_MADCTL_BGR			0x08
#define ILI9341_MADCTL_MH			0x04

#define HX8357_NOP					0x00
#define HX8357_SWRESET				0x01
#define HX8357_RDDID				0x04
#define HX8357_RDDST				0x09

#define HX8357B_RDPOWMODE			0x0A
#define HX8357B_RDMADCTL			0x0B
#define HX8357B_RDCOLMOD			0x0C
#define HX8357B_RDDIM				0x0D
#define HX8357B_RDDSDR				0x0F

#define HX8357_SLPIN				0x10
#define HX8357_SLPOUT				0x11
#define HX8357B_PTLON				0x12
#define HX8357B_NORON				0x13

#define HX8357_INVOFF				0x20
#define HX8357_INVON				0x21
#define HX8357_DISPOFF				0x28
#define HX8357_DISPON				0x29

#define HX8357_CASET				0x2A
#define HX8357_PASET				0x2B
#define HX8357_RAMWR				0x2C
#define HX8357_RAMRD				0x2E

#define HX8357B_PTLAR				0x30
#define HX8357_TEON					0x35
#define HX8357_TEARLINE				0x44
#define HX8357_MADCTL				0x36
#define HX8357_COLMOD				0x3A

#define HX8357_SETOSC				0xB0
#define HX8357_SETPWR1				0xB1
#define HX8357B_SETDISPLAY			0xB2
#define HX8357_SETRGB				0xB3
#define HX8357D_SETCOM				0xB6

#define HX8357B_SETDISPMODE			0xB4
#define HX8357D_SETCYC				0xB4
#define HX8357B_SETOTP				0xB7
#define HX8357D_SETC				0xB9

#define HX8357B_SET_PANEL_DRIVING	0xC0
#define HX8357D_SETSTBA				0xC0
#define HX8357B_SETDGC				0xC1
#define HX8357B_SETID				0xC3
#define HX8357B_SETDDB				0xC4
#define HX8357B_SETDISPLAYFRAME		0xC5
#define HX8357B_SETGAMMA			0xC8
#define HX8357B_SETCABC				0xC9
#define HX8357_SETPANEL				0xCC

#define HX8357B_SETPOWER			0xD0
#define HX8357B_SETVCOM				0xD1
#define HX8357B_SETPWRNORMAL		0xD2

#define HX8357B_RDID1				0xDA
#define HX8357B_RDID2				0xDB
#define HX8357B_RDID3				0xDC
#define HX8357B_RDID4				0xDD

#define HX8357D_SETGAMMA			0xE0

#define HX8357B_SETPANELRELATED		0xE9

#define HX8357B_MADCTL_MY			0x80
#define HX8357B_MADCTL_MX			0x40
#define HX8357B_MADCTL_MV			0x20
#define HX8357B_MADCTL_ML			0x10
#define HX8357B_MADCTL_RGB			0x00
#define HX8357B_MADCTL_BGR			0x08
#define HX8357B_MADCTL_MH			0x04

#define R61581_SOFTRESET			0x01
#define R61581_SLEEPIN				0x10
#define R61581_SLEEPOUT			0x11
#define R61581_NORMALDISP			0x13
#define R61581_INVERTOFF			0x20
#define R61581_INVERTON			0x21
#define R61581_GAMMASET			0x26
#define R61581_DISPLAYOFF			0x28
#define R61581_DISPLAYON			0x29
#define R61581_COLADDRSET			0x2A
#define R61581_PAGEADDRSET			0x2B
#define R61581_MEMORYWRITE			0x2C
#define R61581_MEMORYREAD			0x2E
#define R61581_MEMCONTROL			0x36
#define R61581_MADCTL				0x36
#define R61581_PIXELFORMAT			0x3A
#define R61581_FRAMECONTROL		0xB1
#define R61581_DISPLAYFUNC			0xB6
#define R61581_ENTRYMODE			0xB7
#define R61581_POWERCONTROL1		0xC0
#define R61581_POWERCONTROL2		0xC1
#define R61581_VCOMCONTROL1		0xC5
#define R61581_VCOMCONTROL2		0xC7
#define R61581_POWERCONTROLA		0xCB
#define R61581_POWERCONTROLB		0xCF
#define R61581_POSITIVEGAMMACORR	0xE0
#define R61581_NEGATIVEGAMMACORR	0xE1
#define R61581_DRIVERTIMINGCTLA	0xE8
#define R61581_DRIVERTIMINGCTLB	0xEA
#define R61581_POWERONSEQCONTROL	0xED
#define R61581_ENABLE3G			0xF2
#define R61581_PUMPRATIOCONTROL	0xF7

#define R61581_MADCTL_MY			0x80
#define R61581_MADCTL_MX			0x40
#define R61581_MADCTL_MV			0x20
#define R61581_MADCTL_ML			0x10
#define R61581_MADCTL_RGB			0x00
#define R61581_MADCTL_BGR			0x08
#define R61581_MADCTL_MH			0x04

#define SSD1297_DRVOUTCTL			0x01
#define SSD1297_ENTRYMODE1			0x11
#define SSD1297_ENTRYMODE2			0x15
#define SSD1297_RAMDATA_WRITE		0x22
#define SSD1297_RAMDATA_READ		0x22
#define SSD1297_SETXADDR			0x44
#define SSD1297_SETYADDR_START		0x45
#define SSD1297_SETYADDR_END		0x46
#define SSD1297_SETXCOUNTER			0x4E
#define SSD1297_SETYCOUNTER			0x4F

#define SSD1297_DRVOUTCTL_RL		0x4000
#define SSD1297_DRVOUTCTL_REV		0x2000
#define SSD1297_DRVOUTCTL_BGR		0x0800
#define SSD1297_DRVOUTCTL_SM		0x0400
#define SSD1297_DRVOUTCTL_TB		0x0200

#define SSD1297_ENTRYMODE1_ID0		0x0000
#define SSD1297_ENTRYMODE1_ID1		0x0010
#define SSD1297_ENTRYMODE1_ID2		0x0020
#define SSD1297_ENTRYMODE1_ID3		0x0030
#define SSD1297_ENTRYMODE1_AM		0x0008
